webApp_CAEPlatform/OpenFoamResources/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3785;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3805;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          135;
        startFace       3825;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          155;
        startFace       3960;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3950;
        startFace       4115;
    }
)

// ************************************************************************* //
