webApp_CAEPlatform/OpenFoamResources/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

//написать блок переменных
L 250;
l1 50;
l2 20;
l3 50;
l4 100;
H 80;
h1 22;
h2 20;
h3 40;
A 100;
B 150;
Angle 10.0;
s -0.5;//толщина

//расчёты
point1 #calc "$L - $l4";
point2 #calc "$h3 - $h2";
point3 #calc "$point1 - $l3";
point4 #calc "$point3 - $l2";
point5 #calc "$l1 + (($L - $l1 - $l2 - $l3 - $l4) / 2)";

temp1 #calc "(($L - $l1 - $l2 - $l3 - $l4) / 2)";

radHalfAngle #calc "degToRad($Angle)";
temp2 #calc "$temp1*tan($radHalfAngle)";

point7 #calc "$h1 + $temp2";
//вершины
vertices
(
    (0 0 0) //0
    (0 $h1 0) //1
    (0 $H 0) //2
    ($l1 $H 0) //3
    ($point5 $H 0) //4
    ($point4 $H 0) //5
    ($point3 $H 0) //6
    ($point1 $H 0) //7
    ($L $H 0) //8
    ($L $point2 0) //9
    ($L 0 0) //10
    ($point1 0 0) //11
    ($point1 $point2 0) //12
    ($point3 $point2 0) //13
    ($point3 $h3 0) //14
    ($point4 $h3 0)//15
    ($point5 $point7 0)//16
    ($l1 $h1 0)//17
    ($l1 0 0)//18

    (0 0 $s) //19
    (0 $h1 $s) //20
    (0 $H $s) //21
    ($l1 $H $s) //22
    ($point5 $H $s) //23
    ($point4 $H $s) //24
    ($point3 $H $s) //25
    ($point1 $H $s) //26
    ($L $H $s) //27
    ($L $point2 $s) //28
    ($L 0 $s) //29
    ($point1 0 $s) //30
    ($point1 $point2 $s) //31
    ($point3 $point2 $s) //32
    ($point3 $h3 $s) //33
    ($point4 $h3 $s)//34
    ($point5 $point7 $s)//35
    ($l1 $h1 $s)//36
    ($l1 0 $s)//37
    ($point1 $h3 0)//38
    ($point1 $h3 $s)//39
    ($L $h3 0)//40
    ($L $h3 $s)//41
);

blocks
(
    hex (19 37 36 20 0 18 17 1) (25 10 1) simpleGrading (1 1 1)//1
    hex (20 36 22 21 1 17 3 2) (25 10 1) simpleGrading (1 1 1)//2
    hex (36 35 23 22 17 16 4 3) (20 10 1) simpleGrading (1 1 1)//3
    hex (35 34 24 23 16 15 5 4) (20 10 1) simpleGrading (1 1 1)//4
    hex (34 33 25 24 15 14 6 5) (20 10 1) simpleGrading (1 1 1)//5
    hex (33 39 26 25 14 38 7 6) (25 10 1) simpleGrading (1 1 1)//6
    hex (32 31 39 33 13 12 38 14) (25 5 1) simpleGrading (1 1 1)//7
    hex (39 41 27 26 38 40 8 7) (25 10 1) simpleGrading (1 1 1)//8
    hex (31 28 41 39 12 9 40 38) (25 5 1) simpleGrading (1 1 1)//9
    hex (30 29 28 31 11 10 9 12) (25 5 1) simpleGrading (1 1 1)//10
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 20 19)
            (1 2 21 20)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (41 40 8 27)
            (28 9 40 41)
            (29 10 9 28)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            	
            (21 2 3 22)
            (22 3 4 23)
            (23 4 5 24)
            (24 5 6 25)
            (25 6 7 26)
            (26 7 8 27)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (19 0 18 37)
            (37 18 17 36)
            (36 17 16 35)
            (35 16 15 34)
            (34 15 14 33)
            (33 14 13 32)
            (32 13 12 31)
            (31 12 11 30)
            (30 11 10 29)
        );
    }
    frontAndBack
    {
    	type empty;
    	faces
    	(
            (0 18 17 1)//1
            (1 17 3 2)//2
            (17 16 4 3)//3
            (16 15 5 4)//4
            (15 14 6 5)//5
            (14 38 7 6)//6
            (13 12 38 14)//7
            (38 40 8 7)//8
            (12 9 40 38)//9
            (11 10 9 12)//10
            

            (19 37 36 20)//1
            (20 36 22 21)//2
            (36 35 23 22)//3
            (35 34 24 23)//4
            (34 33 25 24)//5
            (33 39 26 25)//6
            (32 31 39 33)//7
            (39 41 27 26)//8
            (31 28 41 39)//9
            (30 29 28 31)//10
    	);
    }
);

// ************************************************************************* //


